Revit 2024 API
FabricationPart.LiningType Property
 The lining type of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public string LiningType { get; }
Visual Basic
Public ReadOnly Property LiningType As String
	Get
Visual C++
public:
property String^ LiningType {
	String^ get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace